{
  "articles": [
    {
      "title": "More About Doors",
      "content": "The right door is key to the appearance and performance of your home. Look for products that reflect your style as well as your practical needs. With Discount Door and Window you can choose from many energy efficient door options, including patio doors and exterior doors like Vinyl Doors, Fiberglass Doors, and Solid Wood Doors. Discount Door and Window is the place to go for discount doors in San Diego."
    },
    {
      "title": "Step Into Luxury With Doors That Add An Extra Touch Of Elegance",
      "content": "When it comes to elevating the style and sophistication of your home, there's no better place to start than with your doors and door replacement. We specialize in providing high-quality doors that provide security and functionality and add an extra touch of elegance and luxury to your space. From stunning wooden designs to sleek and modern options, our collection of doors offers something for every taste and style."
    },
    {
      "title": "Welcome Your Guests In Style With Our Inviting Doors",
      "content": "Whether you're looking to enhance your home's curb appeal or add a touch of luxury to your interiors, our doors are the perfect choice for those who demand both beauty and functionality. Constitute scrolling the best door designs before you plan for exterior door installation."
    },
    {
      "title": "Wood Entry Doors",
      "content": "Wood entry doors are durable and strong and provide natural insulation, making them energy efficient. They also have a warm and inviting appearance and can add value to a home."
    },
    {
      "title": "Fiberglass Entry Doors",
      "content": "Fiberglass entry doors are a popular and modern option for front doors. They are made of composite materials that are durable, weather-resistant, and energy-efficient. Vinyl Sliding Patio Doors Vinyl sliding patio doors are a practical and cost-effective option for connecting indoor and outdoor living spaces. They are made of PVC (polyvinyl chloride) and are low-maintenance, weather-resistant, and energy-efficient"
    },
    {
      "title": "Fiberglass French Doors",
      "content": "If you are looking for door contractors in San Diego for a modern look, these doors are perfect for you. Fiberglass French doors are a popular and modern option for interior or exterior doors. They are made of composite materials that are durable, weather-resistant, and energy-efficient"
    },
    {
      "title": "French Wood Doors",
      "content": "French wood doors are a classic and traditional option for interior or exterior doors. They also have a warm and inviting appearance and can add value to a home."
    },
    {
      "title": "Vinyl Swinging French Door",
      "content": "These doors are easy to operate and provide excellent ventilation. Vinyl swinging French doors are ideal for creating an elegant and modern look for a home."
    },
    {
      "title": "Why Get The Best Doors With Us?",
      "content": "At Discount Door & Window, we are committed to providing our customers with high-quality doors and windows at affordable prices. We understand the importance of having durable and efficient doors and windows in your home or business, which is why we offer a wide selection of products that are made with top-of-the-line materials and advanced manufacturing techniques. Our team of experts is dedicated to helping you find and buy doors in San Diego, perfect doors and windows that meet your specific needs and preferences."
    },
    {
      "title": "Transform Your Home With Our Doors!",
      "content": "When you choose to buy doors and windows from Discount Door & Window, you can trust that you are getting the best value for your money and that your investment will provide you with years of reliable performance and aesthetic appeal. So, connect with us immediately if you are finding exterior door contractors in San Diego and want to get products at affordable prices."
    }
  ],
  "tax_rebate": {
    "title": "Get Tax Rebate!",
    "description": "Most of Discount Door and Window products qualify for this tax rebate. There are different requirements depending on the climate zone. If you are uncertain if one of our products qualifies for the tax rebate, please contact us and we will verify it for you.",
    "details": {
      "tax_rebate_info": {
        "rebate": "Tax Rebate: 10% of cost of the home improvement, up to a maximum of $500. Windows are capped at $200.",
        "expiration": "Expiration: December 31, 2011",
        "eligibility": "Eligibility: Must be on an existing home & your principal residence. New construction and rentals don’t qualify. Must be placed in service in 2011.",
        "limitations": "Limitations: Tax Credit does NOT include installation costs.",
        "tax_form": "Tax Form: You need to file the 2011 IRS Form 5695 and submit it with your 2011 taxes (by April 15, 2012). On the 1040 form , the residential energy tax credit (from Form 5695) is claimed on line 52.",
        "receipt": "Receipt: Save your receipts and the Manufacturer's Certification Statement for your records.",
        "u_factor": "U-Factor: Windows must have at least 0.35 U-Factor in Southern California. Other locations depend on climate zone. Door U-factor depend on how much glass is used."
      },
      "source": "Energy Star",
      "links": [
        "http://www.energystar.gov/index.cfm?c=tax_credits.tx_index",
        "U-Factor glass requirements for windows and doors:",
        "http://www.energystar.gov/index.cfm?c=windows_doors.pr_anat_window"
      ]
    }
  },
  "diy_install_guides": {
    "title": "DIY Install Guides",
    "description_guide": "Door and Window replacement is a manageable job that does not require a lot of previous knowledge or experience. There are some fundamental aspects you need to know about that we will cover in these DIY guides. Other than that as long as you feel comfortable working with your hands, and can dedicate a day to the project, then DIY is a great way to save additional money.",
    "description_guide1": "There are some other benefits to doing a door or window replacement yourself. First of all, you learn a lot. This knowledge can help with future repairs and maintenance. Secondly, you ensure the job is done the way you want it to be done. You can make adjustments based on your preference. Last but not least, you get a rewarding feeling after completing a job successfully. Here at Discount Door and Window, we want to support you in your door and window replacement projects. This DIY section is dedicated to providing you with the information you need to get the job done. If you still have questions about replacing your door or window, you can contact us and we will try to assist you further.",
    "benefits": [
      "Learn the job: This knowledge can help with future repairs and maintenance.",
      "You save money: You ensure the job is done the way you want it to be done.",
      "Adjustments: Make adjustments based on your preference.",
      "Rewarding: You get a rewarding feeling after completing a job successfully."
    ],
    "note": "Here at Discount Door and Window, we want to support you in your door and window replacement projects. This DIY section is dedicated to providing you with the information you need to get the job done. If you still have questions about replacing your door or window, you can contact us and we will try to assist you further.",
    "related_articles": {
      "diy_window_guides": [
        "How to Install Vinyl Window",
        "How to Apply Caulk to a Window",
        "Replace a Window that is Inset, or Not Flush with the Wall",
        "How to Install a Green House Window",
        "How to Get Accurate Window Measurements"
      ],
      "diy_door_guides": [
        "How to Remove an Exterior Door",
        "How to Paint Smooth Skin Door",
        "How to Paint Fiberglass Door",
        "How to Paint Door Jambs",
        "How to Install an Inswing Exterior Entry Door",
        "How to Install a Dentil Shelf"
      ]
    }
  },
  "whats_right_for_me": {
    "title": "What's Right For Me",
    "description": "Here at Discount Door and Window we offer products that are energy efficient, durable, and cost effective. If you are not sure what type of door or window is the best fit, learn more about the advantages of Vinyl, Fiberglass, or Wood.",
    "benefits": [
      "The best way to hire a pre-approved installer is to purchase the service through our shopping cart when you order your doors and windows. This will ensure an installer will schedule an in-home consultation with you, discuss your options, confirm your measurements, and cover everything required for the job to turn out just the way you want it to. To get started you can click here to hire an installer."
    ],
    "related_articles": {
      "diy_window_guides": [
        "Which caulk should I use?",
        "When to use Tempered Safety Glass",
        "Importance of Energy Efficiency",
        "Door Jambs Explained",
        "10 Things to Know Before You Buy Replacement Windows",
        "What are the advantages of our Vinyl products?",
        "Fiberglass Door Versus Wood Door?",
        "Slab Door Vs. Pre Hung Door",
        "Fiberglass Door Information",
        "Why Replace Your Door or Windows?"
      ]
    }
  },
  "accurate_measurements": {
    "title": "How to Get Accurate Measurements",
    "description": "Getting an accurate measurement on your old door and windows is the most important step in purchasing a new product. The new door or window should be 3/8ths of an inch smaller than the rough opening it will be going into. That way there is room to make adjustment, before sealing it into place.",
    "related_articles": {
      "diy_window_guides": [
        "Learn how to get accurate Window Measurements",
        "Learn how to get accurate Door Measurements"
      ]
    }
  },
  "pre_approved_installer": {
    "title": "Hire a Pre-Approved Installer",
    "description": "The installers we have approved are experienced at removing existing doors and windows, and installing new ones to fit perfectly. They have worked with a wide variety of buildings and unique situations. They will ensure your new window or doors are weatherproof, level, and secure.",
    "description1": [
      "The best way to hire a pre-approved installer is to purchase the service through our shopping cart when you order your doors and windows. This will ensure an installer will schedule an in-home consultation with you, discuss your options, confirm your measurements, and cover everything required for the job to turn out just the way you want it to. To get started you can click here to hire an installer."
    ],
    "related_articles": {
      "diy_window_guides": [
        "Request a Pre-Approved Installer to contact you",
        "Labor Warranty",
        "Hire a Pre-Approved Installer for an in-home consultation",
        "5 Questions You Should Ask an Installer",
        "Apply to Become a Pre-Approved Installer"
      ]
    }
  },
  "accurate_window_measurements": {
    "title": "How to Get Accurate Window Measurements",
    "description": "To find out what size window you should order from our site, you must make an accurate measurement. Your new window will go over the existing frame, so you will be measuring the distance between the inner most parts of the frame. For detailed instructions follow these steps, or watch the tutorial video below.",
    "related_articles": {
      "window_measurements": [
        "Learn how to get accurate Window Measurements",
        "Learn how to get accurate Door Measurements"
      ]
    }
  }
}
