{
  "articles": [
    {
      "title": "More About Doors",
      "content": "The right door is key to the appearance and performance of your home. Look for products that reflect your style as well as your practical needs. With Discount Door and Window you can choose from many energy efficient door options, including patio doors and exterior doors like Vinyl Doors, Fiberglass Doors, and Solid Wood Doors. Discount Door and Window is the place to go for discount doors in San Diego."
    },
    {
      "title": "Step Into Luxury With Doors That Add An Extra Touch Of Elegance",
      "content": "When it comes to elevating the style and sophistication of your home, there's no better place to start than with your doors and door replacement. We specialize in providing high-quality doors that provide security and functionality and add an extra touch of elegance and luxury to your space. From stunning wooden designs to sleek and modern options, our collection of doors offers something for every taste and style."
    },
    {
      "title": "Welcome Your Guests In Style With Our Inviting Doors",
      "content": "Whether you're looking to enhance your home's curb appeal or add a touch of luxury to your interiors, our doors are the perfect choice for those who demand both beauty and functionality. Constitute scrolling the best door designs before you plan for exterior door installation."
    },
    {
      "title": "Wood Entry Doors",
      "content": "Wood entry doors are durable and strong and provide natural insulation, making them energy efficient. They also have a warm and inviting appearance and can add value to a home."
    },
    {
      "title": "Fiberglass Entry Doors",
      "content": "Fiberglass entry doors are a popular and modern option for front doors. They are made of composite materials that are durable, weather-resistant, and energy-efficient. Vinyl Sliding Patio Doors Vinyl sliding patio doors are a practical and cost-effective option for connecting indoor and outdoor living spaces. They are made of PVC (polyvinyl chloride) and are low-maintenance, weather-resistant, and energy-efficient"
    },
    {
      "title": "Fiberglass French Doors",
      "content": "If you are looking for door contractors in San Diego for a modern look, these doors are perfect for you. Fiberglass French doors are a popular and modern option for interior or exterior doors. They are made of composite materials that are durable, weather-resistant, and energy-efficient"
    },
    {
      "title": "French Wood Doors",
      "content": "French wood doors are a classic and traditional option for interior or exterior doors. They also have a warm and inviting appearance and can add value to a home."
    },
    {
      "title": "Vinyl Swinging French Door",
      "content": "These doors are easy to operate and provide excellent ventilation. Vinyl swinging French doors are ideal for creating an elegant and modern look for a home."
    },
    {
      "title": "Why Get The Best Doors With Us?",
      "content": "At Discount Door & Window, we are committed to providing our customers with high-quality doors and windows at affordable prices. We understand the importance of having durable and efficient doors and windows in your home or business, which is why we offer a wide selection of products that are made with top-of-the-line materials and advanced manufacturing techniques. Our team of experts is dedicated to helping you find and buy doors in San Diego, perfect doors and windows that meet your specific needs and preferences."
    },
    {
      "title": "Transform Your Home With Our Doors!",
      "content": "When you choose to buy doors and windows from Discount Door & Window, you can trust that you are getting the best value for your money and that your investment will provide you with years of reliable performance and aesthetic appeal. So, connect with us immediately if you are finding exterior door contractors in San Diego and want to get products at affordable prices."
    }
  ],
  "tax_rebate": {
    "title": "Get Tax Rebate!",
    "description": "Most of Discount Door and Window products qualify for this tax rebate. There are different requirements depending on the climate zone. If you are uncertain if one of our products qualifies for the tax rebate, please contact us and we will verify it for you.",
    "details": {
      "tax_rebate_info": {
        "rebate": "Tax Rebate: 10% of cost of the home improvement, up to a maximum of $500. Windows are capped at $200.",
        "expiration": "Expiration: December 31, 2011",
        "eligibility": "Eligibility: Must be on an existing home & your principal residence. New construction and rentals don’t qualify. Must be placed in service in 2011.",
        "limitations": "Limitations: Tax Credit does NOT include installation costs.",
        "tax_form": "Tax Form: You need to file the 2011 IRS Form 5695 and submit it with your 2011 taxes (by April 15, 2012). On the 1040 form , the residential energy tax credit (from Form 5695) is claimed on line 52.",
        "receipt": "Receipt: Save your receipts and the Manufacturer's Certification Statement for your records.",
        "u_factor": "U-Factor: Windows must have at least 0.35 U-Factor in Southern California. Other locations depend on climate zone. Door U-factor depend on how much glass is used."
      },
      "source": "Energy Star",
      "links": [
        "http://www.energystar.gov/index.cfm?c=tax_credits.tx_index",
        "U-Factor glass requirements for windows and doors:",
        "http://www.energystar.gov/index.cfm?c=windows_doors.pr_anat_window"
      ]
    }
  },
  "diy_install_guides": {
    "title": "DIY Install Guides",
    "description_guide": "Door and Window replacement is a manageable job that does not require a lot of previous knowledge or experience. There are some fundamental aspects you need to know about that we will cover in these DIY guides. Other than that as long as you feel comfortable working with your hands, and can dedicate a day to the project, then DIY is a great way to save additional money.",
    "description_guide1": "There are some other benefits to doing a door or window replacement yourself. First of all, you learn a lot. This knowledge can help with future repairs and maintenance. Secondly, you ensure the job is done the way you want it to be done. You can make adjustments based on your preference. Last but not least, you get a rewarding feeling after completing a job successfully. Here at Discount Door and Window, we want to support you in your door and window replacement projects. This DIY section is dedicated to providing you with the information you need to get the job done. If you still have questions about replacing your door or window, you can contact us and we will try to assist you further.",
    "benefits": [
      "Learn the job: This knowledge can help with future repairs and maintenance.",
      "You save money: You ensure the job is done the way you want it to be done.",
      "Adjustments: Make adjustments based on your preference.",
      "Rewarding: You get a rewarding feeling after completing a job successfully."
    ],
    "note": "Here at Discount Door and Window, we want to support you in your door and window replacement projects. This DIY section is dedicated to providing you with the information you need to get the job done. If you still have questions about replacing your door or window, you can contact us and we will try to assist you further.",
    "related_articles": {
      "diy_window_guides": [
        "How to Install Vinyl Window",
        "How to Apply Caulk to a Window",
        "Replace a Window that is Inset, or Not Flush with the Wall",
        "How to Install a Green House Window",
        "How to Get Accurate Window Measurements"
      ],
      "diy_door_guides": [
        "How to Remove an Exterior Door",
        "How to Paint Smooth Skin Door",
        "How to Paint Fiberglass Door",
        "How to Paint Door Jambs",
        "How to Install an Inswing Exterior Entry Door",
        "How to Install a Dentil Shelf"
      ]
    }
  },
  "whats_right_for_me": {
    "title": "What's Right For Me",
    "description": "Here at Discount Door and Window we offer products that are energy efficient, durable, and cost effective. If you are not sure what type of door or window is the best fit, learn more about the advantages of Vinyl, Fiberglass, or Wood.",
    "benefits": [
      "The best way to hire a pre-approved installer is to purchase the service through our shopping cart when you order your doors and windows. This will ensure an installer will schedule an in-home consultation with you, discuss your options, confirm your measurements, and cover everything required for the job to turn out just the way you want it to. To get started you can click here to hire an installer."
    ],
    "related_articles": {
      "diy_window_guides": [
        "Which caulk should I use?",
        "When to use Tempered Safety Glass",
        "Importance of Energy Efficiency",
        "Door Jambs Explained",
        "10 Things to Know Before You Buy Replacement Windows",
        "What are the advantages of our Vinyl products?",
        "Fiberglass Door Versus Wood Door?",
        "Slab Door Vs. Pre Hung Door",
        "Fiberglass Door Information",
        "Why Replace Your Door or Windows?"
      ]
    }
  },
  "accurate_measurements": {
    "title": "How to Get Accurate Measurements",
    "description": "Getting an accurate measurement on your old door and windows is the most important step in purchasing a new product. The new door or window should be 3/8ths of an inch smaller than the rough opening it will be going into. That way there is room to make adjustment, before sealing it into place.",
    "related_articles": {
      "diy_window_guides": [
        "Learn how to get accurate Window Measurements",
        "Learn how to get accurate Door Measurements"
      ]
    }
  },
  "pre_approved_installer": {
    "title": "Hire a Pre-Approved Installer",
    "description": "The installers we have approved are experienced at removing existing doors and windows, and installing new ones to fit perfectly. They have worked with a wide variety of buildings and unique situations. They will ensure your new window or doors are weatherproof, level, and secure. The best way to hire a pre-approved installer is to purchase the service through our shopping cart when you order your doors and windows.",
    "description1": [
      "This will ensure an installer will schedule an in-home consultation with you, discuss your options, confirm your measurements, and cover everything required for the job to turn out just the way you want it to. To get started you can click here to hire an installer."
    ],
    "related_articles": {
      "diy_window_guides": [
        "Request a Pre-Approved Installer to contact you",
        "Labor Warranty",
        "Hire a Pre-Approved Installer for an in-home consultation",
        "5 Questions You Should Ask an Installer",
        "Apply to Become a Pre-Approved Installer"
      ]
    }
  },
  "accurate_window_measurements": {
    "title": "How to Get Accurate Window Measurements",
    "description": "To find out what size window you should order from our site, you must make an accurate measurement. Your new window will go over the existing frame, so you will be measuring the distance between the inner most parts of the frame. For detailed instructions follow these steps, or watch the tutorial video below.",
    "related_articles": {
      "window_measurements": [
        "Learn how to get accurate Window Measurements",
        "Learn how to get accurate Door Measurements"
      ]
    }
  },
  "caulk_guides": {
    "title": "Which caulk should I use?",
    "introduction": "We offer 2 different types of caulk that are the best for sealing windows and doors: Siliconized Acrylic Sealant, and Polyurethane Sealant. Both are durable and energy efficient and can be used exclusively, but Siliconized Acrylic is recommended for interior caulking, and Polyurethane is recommended for exterior caulking. This is mainly because Polyurethane is toxic.",
    "recommendation": "If you are doing a window installation, we recommend you purchase 1 tube of Polyurethane Caulk, and 1 tube of Siliconized Acrylic Caulk. Use the Polyurethane on the outside of the window, and the Siliconized Acrylic on the inside of the window. You may also need some Expanding Foam Sealant, and Vinyl Trim Strips to fill in and cover up any gaps. This is explained in the Do-It-Yourself article about how to apply caulk.",
    "sealant_types": [
      {
        "type": "Siliconized Acrylic Sealant",
        "description": [
          "Siliconized acrylic caulk is a little less durable than polyurethane, but it is easier to work with since it cleans up with water, and better tolerated by those with chemical sensitivities. Siliconized acrylic caulk can be painted over after is applied. The added silicone makes it more water resistant and flexible. It is the best choice for interior caulking, but can also be used on exterior caulking.",
          "The Siliconized acrylic caulk we recommend is called RCS20, made by GE: Product page for Siliconized Acrylic Sealant RCS20."
        ],
        "image": "src/assets/whatsrightforme2.png"
      },
      {
        "type": "Polyurethane Sealant",
        "description": [
          "Polyurethane caulks are paintable, flexible, and weather resistant. They have superior bonding ability, to the extent that they can be used as an adhesive in certain applications. Because of this, polyurethane caulk works well in joints between dissimilar materials.",
          "The downside to this type of caulk is that it is somewhat messy to work with, as it is stringy and sticks to your hands and clothes. It must be cleaned up with mineral spirits, as it is not water soluble. It can also be somewhat toxic, so it should not be applied around intake ducts or ventilation grilles, where siliconized acrylic latex caulk should be used.",
          "The Polyurethane Sealant we recommend is SM7108 Permathane made by Schnee-Morehead."
        ],
        "image": "src/assets/whatsrightforme1.png"
      }
    ]
  },
  "approvedInstallerDoorWindow": {
    "title": "Hire a Pre-Approved Installer - Discount Door & Window",
    "description": "All of our pre-approved installers are licensed and experienced contractors. The installer will match the manufacturer's warranty on the products installed. This means that if a door has a lifetime warranty, then the labor for installing the door will also have a lifetime warranty. That way if there is an issue with the door that was caused by the installer, it will be repaired by the installer. If there is an issue with the door caused by a defect in the door, then the manufacturer will repair or replace the door.",
    "description1": "All Doors and Windows we sell come with their full-factory manufacturer warranty. Please read the manufacturer warranty thoroughly and follow all requirements. Failing to follow manufacturer's requirements and instruction will void your warranty.",
    "related_articles": {
      "diy_window_guides": [
        {
          "prefix": "Vinyl Windows and Patio Doors have a",
          "underlinedText": "Limited Lifetime Warranty.",
          "url": "/https://discountdw.com/p-6058-warranty-on-windows-and-vinyl-doors.html"
        },
        {
          "prefix": "Wood Doors have a",
          "underlinedText": "1 Year Warranty.",
          "url": "/https://discountdw.com/files/documents/aaw-warranty.pdf"
        },
        {
          "prefix": "Wood grain Fiberglass Doors have a",
          "underlinedText": "Limited Lifetime Warranty.",
          "url": "/https://discountdw.com/p-6058-warranty-on-windows-and-vinyl-doors.html"
        },
        {
          "prefix": "Smooth skin fiberglass doors have a",
          "underlinedText": "25 year warranty.",
          "url": "/https://discountdw.com/files/documents/plastpro_smoothskin_warranty_0824.pdf"
        }
      ]
    }
  },
  "vinyl_window": {
    "title": "Vinyl Window Installation",
    "description_guide": "First measure your old window. If you need help on making proper measurements, please click here. Next, follow the instructions and video tutorials below to learn how to install your new window.",
    "related_articles": {
      "diy_window_guides": [
        "Polyurethane caulking for exterior",
        "Silicon acrylic caulking for interior",
        "Minimal expansion foam for insulation",
        "Trim strip to cover up the gap in the interior",
        "Caulking gun to dispense the sealant",
        "Four 2 1/2\" or 3\" screws.",
        "Drill to make holes for the screws",
        "Rag to clean of the excess caulking",
        "Gloves to protect from caulking",
        "Shims to adjust the window placement"
      ],
      "diy_door_guides": ["Step ladder", "Spirit level", "Glass cleaner"]
    },
    "installation_steps": [
      {
        "step": 1,
        "title": "Remove old aluminum window panes and vertical meeting rail",
        "details": [
          "To remove the sliding pane, open it all the way, then shift it upwards and rotate the bottom towards you.",
          "Remove any screws that may be holding it in place.",
          "Most of the time, the center vertical meeting rail and fixed panel come out easily after removing the screws. You may need to pry it out with a mallet and screwdriver. If that does not work, you can use a hacksaw to cut through the meeting rail. You should not need to break the glass.",
          "The aluminum outer frame can remain in place."
        ]
      },
      {
        "step": 2,
        "title": "Place the new vinyl window into the frame to make sure it fits correctly. Then remove it from the frame."
      },
      {
        "step": 3,
        "title": "Put a bead of polyurethane caulk around the old aluminum window frame.",
        "details": [
          "Leave two or three 3\" gaps at the bottom to allow moisture to leak out."
        ]
      },
      {
        "step": 4,
        "title": "Place the vinyl window into the frame so that it pushes up against the caulk and creates a seal."
      },
      {
        "step": 5,
        "title": "Adjust the window so that it is level, and the sliding panel operates smoothly.",
        "details": [
          "Use a spirit level to determine if the window is level.",
          "You may need to place shims to make adjustments."
        ]
      },
      {
        "step": 6,
        "title": "Drill 4 screws through the right and left side of the vinyl frame into the the wall to hold it in place.",
        "details": [
          "Drill holes with a drill, then screw in the 3 screws with a screw driver.",
          "Make sure the screws do not hinder the opening or closing of the sliding window.",
          "Do not tighten the screws too tight or it may bend the vinyl frame. The screw may stick out a bit."
        ]
      },
      {
        "step": 7,
        "title": "Spray expanding foam into the interior gap around the frame for insulation."
      },
      {
        "step": 8,
        "title": "Place trim around the outside of the interior of the frame to cover up the gap between the vinyl frame and the wall."
      },
      {
        "step": 9,
        "title": "Put siliconized acrylic sealant in the gap between the trim and the wall to create a smooth seal.",
        "details": ["Wipe off any excess sealant with a rag."]
      },
      {
        "step": 10,
        "title": "Put siliconized acrylic sealant in the gap between the trim and the wall to create a smooth seal."
      }
    ]
  },
  "labour_estimate": {
    "title": "Hire an Installer for in-home estimate",
    "SKU": "6679813",
    "description": "This service is for an installer to meet you at your location, discuss options, do measurements, and make a work order for your unique situation.",
    "note": "There is no charge for estimates. All appointments must be verified by phone before we will dispatch a consultant. Free Estimates are available only in San Diego and surrounding county.",
    "image": "URL_to_image",
    "what_to_expect": {
      "title": "What to Expect:",
      "description": "When you order this service, an installer will contact you to schedule a time to meet at your location to verify measurements and discuss options with you. This will ensure the final result will be exactly how you want it. Here are estimates that the installer will probably quote on standard door and window installations. Keep in mind that the $75 you pay here is deducted from the final installation prices below.",
      "pricing_estimates": [
        "Each window usually costs $200 to install.",
        "Each patio door usually costs $400 to install.",
        "Each front door usually costs $600 to install."
      ],
      "included_services": [
        "Materials such as: Caulking Sealant & Trim.",
        "Adding Trim or Transition strips where needed.",
        "Interior molding.",
        "Transporting Door and Window to your location if in Southern California.",
        "Old Door and Window removal and disposal."
      ]
    },
    "labor_warranty_information": {
      "title": "Labor Warranty Information:",
      "description": "All pre-approved installers are licensed and experienced contractors. The labor warranty will match the duration of the manufacturer’s warranty on the products installed. This means that if a door has a lifetime warranty, then the labor to install the door will also have a lifetime warranty. That way if there is an issue with the door that was caused by the installer, it will be covered by the installer. If there is an issue with the door caused by a defect in the door, then the manufacturer will repair or replace the door.",
      "link_text": "Read more about labor warranty here",
      "link_url": "URL_to_labor_warranty_information"
    }
  },
  "tempered_safety_glass": {
    "title": "When to use Tempered Safety Glass",
    "introduction": {
      "text": "When you are doing a window replacement job, you should be aware that there are Universal Building Codes that you need to abide by. The main one you need to understand is when it is required to use Tempered safety glass.",
      "definition": "Tempered glass is glass that has an extra procedure done to it to make it 4 to 5 times stronger. The procedure involves heating the glass up, and then cooling it down rapidly. This process makes the glass stronger, and also changes the way the glass breaks. The glass shatters into small blocks that are much less likely to cause injury. That is why Tempered glass is also called Safety glass."
    },
    "hazardous_areas": {
      "introduction": "The areas considered to be hazardous safety glazing areas requiring tempered glass are:",
      "list": [
        "Glass in any door.",
        "Glass in any kind of shower, bathtub area, hot tub, steam room, sauna or whirlpool area where the bottom edge of the glass is less than 60 inches above a standing surface and drain outlet.",
        "Glass in fixed or operable panels adjacent to a door where the nearest exposed edge of the glazing is within a 24” arc of either vertical edge of the door in a closed position and where the bottom edge of the glazing is less than 60” above a walking surface.",
        {
          "conditions": [
            "18” above the floor in addition to 24” from a door.",
            "If a glass is 72” above the deck of a tub it has to be tempered.",
            "If glass is 42” from the floor in a stairwell it has to be tempered."
          ],
          "text": "Glass in fixed or operable panels that meets all of the following conditions."
        },
        {
          "conditions": [
            "The bottom edge of the glazing is less than 60” above a pool side of the glazing.",
            "The glazing is within 5 feet of a swimming pool or spa deck area."
          ],
          "text": "Glass in walls used as a barrier for indoor or outdoor swimming pools or spas when both of the following exist."
        },
        "Glass in walls enclosing stairway landings or within 5 feet of the bottom and top of stairways where the bottom edge of the glass is less than 60” above a walking surface."
      ]
    },
    "recommendation": "You can select tempered glass on any of the windows you order from Discount Door and Window. Select 'Glass Strength' option, and choose tempered glass.",
    "references": {
      "title": "For more information about the universal building code on Safety glass check our references:",
      "links": [
        "Consumer Product Safety Commission",
        "California Building Standards Commission",
        "The Safety Glazing Certification Council (SGCC)"
      ]
    },
    "images": [
      {
        "title": "When to use Tempered Safety Glass",
        "description": "Illustrative image of tempered glass"
      },
      {
        "title": "When Safety Glass is Required",
        "sub_images": [
          {
            "label": "GLASS IN SIDELITES - ELEVATION",
            "description": "Diagram showing required safety glazing locations"
          },
          {
            "label": "PLAN VIEW",
            "description": "Diagram showing plan view of safety glazing areas"
          },
          {
            "label": "GLASS WITHIN SHOWER WALLS",
            "description": "Diagram showing where safety glazing is required within shower walls"
          }
        ]
      }
    ]
  },
  "energy_efficiency": {
    "title": "Energy Efficiency",
    "introduction": {
      "text": "An average home may lose up to 30% of its heat or air-conditioning energy through in-efficient doors and windows. This can be due to a lot of reasons, but mostly because of out-dated technology, poorly sealed doors, and single pane windows. Most homeowners are well aware of this after walking into a room with old windows, and feeling the unsettling winter chill. Over the years there have been monumental improvements in door and window energy efficiency technology."
    },
    "doors_and_windows": {
      "text": "Here at Discount Door and Window, we have selected products that we have found to be very energy efficient, durable and low cost. All of our windows qualify for a Tax Rebate if you use them to replace old aluminum or wood windows. This is because the amount of energy you save is large enough that the government wants to encourage homeowners to make the upgrade. With this tax rebate, and monthly savings on the energy bill, our retrofit vinyl windows will pay for themselves within a few years."
    },
    "energy_efficient_technology": {
      "text": "There are a lot of qualities that attribute to how efficient our doors and windows are, but the most distinguishing features are the double pane with argon gas and Low-E technology. Low-E is short for 'low-emissivity.' It is a high-tech coating on the glass that is designed to block much of the heat and ultra-violet light from the sun, while permitting a large percentage of visible light. Argon-filled double pane glass provides excellent insulation. These technology help keep the warmth in during the winter, and the heat out the summer."
    },
    "measuring_efficiency": {
      "text": "When purchasing new windows or doors, there are two key measure of efficiency that should be considered. The U-value of a window or door is a measure of heat loss. And the “Solar Heat Gain Coefficient” (SHGC) which measures how well a product blocks heat from the sun. For both of these measurements: the lower the number the higher the efficiency. These numbers are calculated by the National Fenestration Rating Council (NFRC). Our windows at Discount Door and Window have a U-Value of atleast 0.3"
    },
    "conclusion": {
      "text": "If you have old doors and windows in your home, you have a lot to gain by replacing them with higher efficiency products. It will increase the comfort and style in your home, and save you money on your energy bill. Here at Discount Door and Window our goal is to provide you with replacement doors and windows that are affordable, durable, and energy efficient. We also empower you to make informed decisions by providing information, and video tutorials on how to get stuff done in a cost effective way."
    }
  },
  "questions_installer": {
    "title": "5 Questions You Should Ask an Installer",
    "questions": [
      {
        "question": "How long will the project take?",
        "answer": "It usually takes between 2 to 4 weeks for the doors and windows to be ready for installation. The installation itself should take 1 or 2 days, depending on how many doors and windows to install."
      },
      {
        "question": "What does the overall process involve?",
        "answer": "Make sure the Installer knows all the details of your situation, and that you know what will happen next."
      },
      {
        "question": "Are you a licensed contractor?",
        "answer": "Our installers are licensed contractors."
      },
      {
        "question": "What if something goes wrong?",
        "answer": "Make sure you have their direct contact information, so you can contact them if something doesn't go as expected, or there is a change in plan."
      },
      {
        "question": "What warranties will I receive?",
        "answer": "Most of our doors and windows have a limited lifetime warranty from the manufacturer. The labor warranty duration will match the manufacturer's warranty. Check to make sure you know what warranty your products have. Read more about our warranties."
      }
    ]
  },
  "green_house_content": [
    {
      "step": "Step 1",
      "description": "Frame rough opening equal to window call out size. Rough opening should be plumb, square, and sill should be level. For stucco applications furring strips of at least 3/8' thick, should be used around entire perimeter to allow for proper clearance or optional stucco mold can be purchased, see number 5 below. For special size Tru-Frame® Greenhouse Windows the suggested rough opening size is:Width 5 1/2' Less Fin to Fin DimensionHeight 3 3/8' Less Fin to Fin Dimension",
      "image": "greenhousewindowfig1.png"
    },
    {
      "step": "Step 2",
      "description": "Apply the flashing paper in the normal manner. First the sill strip, then the jamb strips. The top flashing goes on after the window is installed and overlaps the top window fin. (See Figure 2)",
      "image": "vinylwindow.png"
    },
    {
      "step": "Step 3",
      "description": "Center the Tru-Frame® Greenhouse Window in rough opening allowing equal clearance on both sides and top. Bottom pan should line up with the finished sill height, allowing for any inside additional materials such as tile (see figure 3). Attach window to jambs, sill, and header with screws long enough to penetrate through any furring strips and deep into framing. A ribbon of caulking between the frame and flashing is a must.",
      "image": "greenhousewindowfig1.png"
    },
    {
      "step": "Step 4",
      "description": "For window sizes 5' and larger, support bracing is highly recommended on each end of the window (Warranty could be void without proper support). These supports can be constructed as part of the wall framing or metal support brackets may be fabricated to adequately support the window. Support brackets can be purchased separately from your Tru-Frame® Dealer. Fasteners to be supplied by installer (1/4' X 3' Lag screws are suggested for wall mounting). Brackets must attach to the vertical studs below the window. For 8' windows a third support should also be used in the center. (see figure 3)",
      "image": "greenhousewindowfig1.png"
    },
    {
      "step": "Step 5",
      "description": "Optional extruded aluminum stucco molding is cut square to fit around the perimeter of the window. Jamb moldings fit between header and sill moldings. Stucco moldings can be purchased separately from your Tru-Frame® Dealer. (See Figure 4a, 4b, and 4c)",
      "image": "greenhousewindowfig1.png"
    }
  ]
}
